{
    "all_resources": [
        {
            "id": "project-ideas",
            "name": "Project Ideas",
            "description": "Finding projects to build is a difficult task, that's why we are going to provide project ideas so that you can start building your projects sooner."
        },
        {
            "id": "api-services",
            "name": "API Services",
            "description": "Finding perfect API for project is a bit difficult task but now We are going to provide a list of API services that you can use to build your projects faster and easier than ever before." 
        },
        {
            "id": "illustrations-link",
            "name": "Illustrations",
           "description": "Illustrations are hard to find, but not anymore I have curated a list of websites that provide free/paid illustrations that you can use in your projects." 
        },
        {
            "id": "icons-link",
            "name": "Icons",
            "description": "Finding perfect icons for projects can be very hard, from this list you can find the best free/paid icons for your projects. Use them and make awesome projects."
        },
        {
            "id": "images-link",
            "name": "Images",
            "description": " Finding perfect images for projects can be very hard, from this list you can find the best free/paid images for your projects. Use them and make awesome projects."
        },
        {
            "id": "youtube-channels",
            "name": "Youtube",
            "description": " Youtube is a great platform to learn new things, from this list you can find the best youtube channels that you can follow to learn new things and improve your skills."
        },
        {
            "id": "udemy-courses",
            "name": "Udemy Courses",
            "description": " Udemy is a great platform to learn new things, from this list you can find the best udemy courses that you can buy to learn new things and improve your skills. This list includes both free and paid courses."
        },
        {
            "id": "chrome-extensions",
            "name": "Chrome Extension",
            "description": " Chrome extensions can be very useful, from this list you can find the best chrome extensions that you can use to improve your productivity and make your life easier."
        },
        {
            "id": "github-repos",
            "name": "Github Repositrories",
            "description": " Github is a great platform to find many useful things as a developer ,from this list you can find the best github repositories that you can use to learn new things and improve your skills."
        },
        {
            "id": "design-templates",
            "name": "Website Design Templates",
            "description": "Website Design and Templates are very useful when you know what you want to build but don't know how to design it. From this list you can find the best design templates that you can use to build your projects."
        },
        {
            "id": "websites",
            "name": "Useful websites",
            "description": "There are thousands of websites on the internet but not all of them are useful. From this list you can find the best websites that you can use to improve your productivity and make your life easier."
        },
        {
            "id": "stay-tuned",
            "name": "Stay Tuned",
            "description": " Stay Tuned for more updates. We will update this list regularly so that you can get the best content for your projects. Till then you can check out our other projects. Stay Safe and Happy Coding :)"
        }
    ],

    "resources": [
        {
            "id": "stay-tuned",
            "name": "Stay Tuned",
            "description": " Stay Tuned for more updates. We will update this list regularly so that you can get the best content for your projects. Till then you can check out our other projects. Stay Safe and Happy Coding :)",
            "ideas":[
                {
                    "id": 1,
                    "name": "Working on it",
                    "description": "We are working on it. We will update this list regularly so that you can get the best content for your projects. Till then you can check out our other projects. Stay Safe and Happy Coding :)",
                    "type": "Work in Progress"
                }
            ]
        },

        {
            "id": "project-ideas",
            "name" : "Project Ideas",
            "description": "Finding projects to build is a difficult task, that's why we are going to provide project ideas so that you can start building your projects sooner. Here are some project ideas that you can build to improve your skills and build your portfolio. You can also search for project ideas by difficulty level.",
            "ideas" : [
                {
                    "id": 1,
                    "name": "Personal Blog",                    
                    "description": "Create a simple blog site using a CMS platform like WordPress or create a custom blog site using HTML, CSS, and JavaScript.",
                    "type": "Beginner"
                },
                {
                    "id": 2,
                    "name": "Static Business Website",                    
                    "description": "Build a website for a small business that consists of a few static pages containing information about the business, its products, and services.",
                    "type": "Beginner"
                },
                {
                    "id": 3,
                    "name": "Recipe Book",                    
                    "description": "Create a recipe book website using a CMS platform like WordPress or a custom-built website with features like search, filters, and social sharing.",
                    "type": "Beginner"
                },
                {
                    "id": 4,
                    "name": "E-commerce Website",                    
                    "description": "Build an online store using a CMS platform like Shopify or a custom-built website with features like product listings, cart, checkout, and payment gateway integration.",
                    "type": "Intermediate"
                },
                {
                    "id": 5,
                    "name": "Job Board",                    
                    "description": "Create a job board website that allows employers to post job listings and job seekers to apply for those jobs.",
                    "type": "Intermediate"
                },
                {
                    "id": 6,
                    "name": "Social Media Platform ",                    
                    "description": "Build a social media platform that enables users to create profiles, share posts, follow others, and interact with each other.",
                    "type": "Intermediate"
                },
                {
                    "id": 7,
                    "name": "Online Learning Platform",                    
                    "description": "Create an e-learning platform that offers courses, quizzes, and assessments for students to learn online.",
                    "type": "Intermediate"
                },
                {
                    "id": 8,
                    "name": "News Aggregator",                    
                    "description": "Build a news aggregator that collects news articles from various sources and presents them to users based on their preferences.",
                    "type": "Intermediate"
                },
                {
                    "id": 9,
                    "name": "Real Estate Listings",                    
                    "description": "Create a real estate listings website that enables users to search for properties, view property details, and contact real estate agents.",
                    "type": "Intermediate"
                },
                {
                    "id": 10,
                    "name": "Online Booking System",                    
                    "description": "Build an online booking system for hotels, flights, or other services that enables users to search for availability and make reservations.",
                    "type": "Intermediate"
                },
                {
                    "id": 11,
                    "name": "Food Ordering System",                    
                    "description": "Create an online food ordering system for restaurants that allows users to browse menus, place orders, and make payments.",
                    "type": "Intermediate"
                },
                {
                    "id": 12,
                    "name": "Classifieds Website",                    
                    "description": "Build a classifieds website that enables users to post ads for various items or services and allows others to search for those ads.",
                    "type": "Intermediate"
                },
                {
                    "id": 13,
                    "name": "Content Management System",                    
                    "description": "Create a custom CMS platform that enables users to manage website content, including pages, posts, images, and videos.",
                    "type": "Advanced"
                },
                {
                    "id": 14,
                    "name": "Customer Relationship Management System",                    
                    "description": "Build a custom CRM system that allows businesses to manage customer interactions, including sales, marketing, and support.",
                    "type": "Advanced"
                },
                {
                    "id": 15,
                    "name": "Music Streaming Platform",                    
                    "description": "Create a music streaming platform that enables users to listen to music, create playlists, and share their favorite songs.",
                    "type": "Advanced"
                },
                {
                    "id": 16,
                    "name": "Health and Fitness Tracker",                    
                    "description": "Build a health and fitness tracker that allows users to set goals, track progress, and get recommendations based on their data.",
                    "type": "Advanced"
                },
                {
                    "id": 17,
                    "name": "Crowdfunding Platform",                    
                    "description": "Create a crowdfunding platform that enables users to raise money for their projects and allows others to contribute to those projects.",
                    "type": "Advanced"
                },
                {
                    "id": 18,
                    "name": "Virtual Event Platform",                    
                    "description": "Build a virtual event platform that enables users to host webinars, conferences, and other events online.",
                    "type": "Advanced"
                    
                },
                {
                    "id": 19,
                    "name": "Blockchain-based Application",                    
                    "description": "Create a decentralized application using blockchain technology, such as a cryptocurrency wallet or a voting system.",
                    "type": "Advanced"
                },
                {
                    "id": 20,
                    "name": "Augmented Reality Application",                    
                    "description": "Build an augmented reality application that enhances real-world experiences with virtual objects, such as a virtual try-on feature for fashion items.",
                    "type": "Advanced"

                },
                {
                    "id": 21,
                    "name": "Stock Market Tracker",                    
                    "description": "Create a stock market tracker that allows users to view stock prices, track their portfolio, and get real-time updates.",
                    "type": "Intermediate"

                },
                {
                    "id": 22,
                    "name": "Online Resume Builder",                    
                    "description": "Build an online resume builder that allows users to create professional resumes and cover letters.",
                    "type": "Intermediate"

                },
                {
                    "id": 23,
                    "name": "Event Management System",                    
                    "description": "Create an event management system that enables users to plan and manage events, including ticketing, registration, and promotion.",
                    "type": "Advanced"

                },
                {
                    "id": 24,
                    "name": "Online Code Editor",                    
                    "description": "Build an online code editor that allows users to write and run code in various programming languages. For more difficulty, add features like syntax highlighting and code completion.",
                    "type": "Intermediate / Advanced"

                },
                {
                    "id": 25,
                    "name": "Web-based Calculator",                    
                    "description": "Create a web-based calculator that allows users to perform basic math operations, such as addition, subtraction, multiplication, and division.",
                    "type": "Beginner"

                },
                {
                    "id": 26,
                    "name": "Social Network Analysis Tool",                    
                    "description": "Build a tool that analyzes social networks, such as Facebook and Twitter, to identify trends and patterns in user behavior.",
                    "type": "Advanced"

                },
                {
                    "id": 27,
                    "name": "Online Voting System",                    
                    "description": "Create an online voting system that allows users to vote on various topics and view the results in real-time. For more difficulty, add features like authentication and security.",
                    "type": "Intermediate / Advanced"

                },
                {
                    "id": 28,
                    "name": "Online Bookstore",                    
                    "description": "Build an online bookstore that allows users to browse books, add them to a shopping cart, and make purchases.",
                    "type": "Intermediate"

                },
                {
                    "id": 29,
                    "name": "Language Learning Application",                    
                    "description": "Create a language learning application that allows users to learn new languages through interactive lessons and activities. ",
                    "type": "Intermediate / Advanced"

                },
                {
                    "id": 30,
                    "name": "Online Ticket Booking System",                    
                    "description": "Build an online ticket booking system for movies, concerts, or other events that allows users to search for availability and make reservations. For more difficulty, add features like seat selection and payment processing.",
                    "type": "Intermediate / Advanced"

                },
                {
                    "id": 31,
                    "name": "Music Streaming Platform",                    
                    "description": "Create a music streaming platform that enables users to listen to music, create playlists, and share their favorite songs.",
                    "type": "Advanced"

                },
                {
                    "id": 32,
                    "name": "Fitness Tracker",                    
                    "description": "Build a fitness tracker that allows users to set goals, track progress, and get recommendations based on their data.",
                    "type": "Intermediate"

                },
                {
                    "id": 33,
                    "name": "Online Appointment Scheduler",                    
                    "description": "Create an online appointment scheduler that allows users to book appointments with businesses, such as doctors, dentists, and salons. For more difficulty, add features like calendar integration and payment processing.",
                    "type": "Intermediate / Advanced"

                },
                {
                    "id": 34,
                    "name": "Quiz App",                    
                    "description": "Develop a quiz application that tests users on various topics. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the quiz logic.",
                    "type": "Beginner"

                },
                {
                    "id": 35,
                    "name": "To-Do List",                    
                    "description": "Create a to-do list application that allows users to add, edit, and delete tasks. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the to-do list logic.",
                    "type": "Beginner"

                },
                {
                    "id": 36,
                    "name": "Weather App",                    
                    "description": "Build a weather application that displays the current weather conditions for a given location. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the weather data.",
                    "type": "Beginner"

                },
                {
                    "id": 37,
                    "name": "Quote Generator",                    
                    "description": "Create a quote generator that displays random quotes to the user. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the quote generation logic.",
                    "type": "Beginner"

                },
                {
                    "id": 38,
                    "name": "Weather App",                    
                    "description": "Build a weather application that displays the current weather conditions for a given location. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the weather data.",
                    "type": "Beginner"

                },
                {
                    "id": 39,
                    "name": "Pomodoro Timer",                    
                    "description": "Create a pomodoro timer that allows users to set a timer for 25 minutes and take a 5-minute break. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the timer logic.",
                    "type": "Beginner"

                },
                {
                    "id": 40,
                    "name": "Random Password Generator",                    
                    "description": "Build a random password generator that allows users to generate a random password based on their preferences. You can use HTML, CSS, and JavaScript to build the user interface and JavaScript to handle the password generation logic.",
                    "type": "Beginner"

                }
            ]
        },
        {
            "id": "api-services",
            "name" : "API Services",
            "description": "Finding perfect API for project is a bit difficult task but now We are going to provide a list of API services that you can use to build your projects faster and easier than ever before. You can also search according to Free or Paid API services.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "NASA API",
                    "description": "NASA API is a RESTful API that allows you to search for images and videos from NASA's library of content. You can use this API to build applications that display NASA's content on your website or mobile app.",
                    "url": "https://api.nasa.gov/",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "Cat Facts API",
                    "description": "Cat Facts API is a RESTful API that allows you to search for cat facts. You can use this API to build applications that display cat facts on your website or mobile app.",
                    "url": "https://alexwohlbruck.github.io/cat-facts/",
                    "type": "Free"
                },
                {
                    "id": 3,
                    "name" : "Currency API",
                    "description": "Currency API is a RESTful API that allows you to search for currency exchange rates. You can use this API to build applications that display currency exchange rates on your website or mobile app.",
                    "url": "https://github.com/fawazahmed0/currency-api",
                    "type": "Free"
                },
                {
                    "id": 4,
                    "name" : "Facts API",
                    "description": "Facts API is a RESTful API that allows you to search for facts. You can use this API to build applications that display facts on your website or mobile app.",
                    "url": "https://fungenerators.com/api/facts/",
                    "type": "Free"
                },
                {
                    "id": 5,
                    "name" : "JSON Placeholder API",
                    "description": "JSON Placeholder API is a RESTful API that allows you to search for posts, comments, albums, photos, todos, and users. You can use this API to build applications that display posts, comments, albums, photos, todos, and users on your website or mobile app.",
                    "url": "https://jsonplaceholder.typicode.com/",
                    "type": "Free"
                },
                {
                    "id": 6,
                    "name" : "Google Translator API",
                    "description": "Google Translator API is a RESTful API that allows you to translate text from one language to another. You can use this API to build applications that translate text on your website or mobile app.",
                    "url": "https://cloud.google.com/translate/docs/",
                    "type": "Freemium"
                },
                {
                    "id": 7,
                    "name" : "Open Weather API",
                    "description": "Open Weather API is a RESTful API that allows you to search for weather data. You can use this API to build applications that display weather data on your website or mobile app.",
                    "url": "https://openweathermap.org/api",
                    "type": "Freemium"

                },
                {
                    "id": 8,
                    "name" : "Countries API",
                    "description": "Countries API is a RESTful API that allows you to search for countries. You can use this API to build applications that display countries on your website or mobile app.",
                    "url": "https://restcountries.com/",
                    "type": "Free"
                },
                {
                    "id": 9,
                    "name" : "Random Data API",
                    "description": "Random Data API is a RESTful API that allows you to search for random data. You can use this API to build applications that display random data on your website or mobile app.",
                    "url": "https://random-data-api.com/",
                    "type": "Free"

                },
                {
                    "id": 10,
                    "name" : "Poke API",
                    "description": "Poke API is a RESTful API that allows you to search for Pokemon. You can use this API to build applications that display Pokemon on your website or mobile app.",
                    "url": "https://pokeapi.co/",
                    "type": "Free"
                },
                {
                    "id": 11,
                    "name" : "Rapid API",
                    "description": "Rapid API is a website which provides a list of APIs that you can use to build your projects faster and easier than ever before. You can use this website to find APIs for your projects.",
                    "url": "https://rapidapi.com/",
                    "type": "Freemium"
                },
                {
                    "id": 12,
                    "name" : "Any API",
                    "description": "Any API is a website which provides a list of APIs that you can use to build your projects faster and easier than ever before. You can use this website to find APIs for your projects.",
                    "url": "https://any-api.com/",
                    "type": "Free"
                },
                {
                    "id": 13,
                    "name" : "Public APIs",
                    "description": "Public APIs is a website which provides a list of APIs that you can use to build your projects faster and easier than ever before. You can use this website to find APIs for your projects.",
                    "url": "https://publicapis.dev/",
                    "type": "Free"
                },
                {
                    "id": 14,
                    "name" : "Bhagvad Gita API",
                    "description": "Bhagvad Gita API is a RESTful API that allows you to search for Bhagvad Gita. You can use this API to build applications that display Bhagvad Gita shloks, chapters, verses on your website or mobile app.",
                    "url": "https://bhagavadgitaapi.in/",
                    "type": "Free"
                },
                {
                    "id": 15,
                    "name" : "Mockaroo",
                    "description": "Mockaroo is not exactly an API but it will provide some dummy data in json format which you can use to learn many concept of javascript like array mannipulation, array mapping, filtering, etc.",
                    "url": "https://www.mockaroo.com/",
                    "type": "Free"
                }
            ]
        },
        {
            "id": "illustrations-link",
            "name" : "Illustrations",
            "description": "Finding perfect illustrations for project is a bit difficult task but now We are going to provide a list of illustrations that you can use to build your projects faster and easier than ever before. You can also search for illustrations according to Free, or Freemium/Paid. ",

            "ideas":[
                {
                    "id": 1,
                    "name" : "Zor Stock Illustrations",
                    "description": "Zor Stock Illustrations is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "http://zorstock.com/",
                    "type": "Freemium"
                },
                {
                    "id": 2,
                    "name" : "Vecteezy",
                    "description": "Vecteezy is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "http://vecteezy.com/browse",
                    "type": "Freemium"

                },
                {
                    "id": 3,
                    "name" : "The Noun Project",
                    "description": "The Noun Project is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://thenounproject.com/",
                    "type": "Free" 
                },
                {
                    "id": 4,
                    "name" : "Vector4Free",
                    "description": "Vector4Free is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.vector4free.com/",
                    "type": "Free"
                },
                {
                    "id": 5,
                    "name" : "ShutterStock",
                    "description": "ShutterStock is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.shutterstock.com/vectors#free-download",
                    "type": "Freemium"
                },
                {
                    "id": 6,
                    "name" : "Humaans",
                    "description": "Humaans is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.humaaans.com/",
                    "type": "Free"
                },
                {
                    "id": 7,
                    "name" : "WebKul | Vivid",
                    "description": "Vivid is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://webkul.github.io/vivid/",
                    "type": "Free"
                },
                {
                    "id": 8,
                    "name" : "Interfacer",
                    "description": "Interfacer is a website which provides a list of illustrations that you can use to build your projects faster and easier than ever before.",
                    "url": "https://interfacer.xyz/",
                    "type": "Free"
                }
            ]
        },
        {
            "id": "icons-link",
            "name" : "Icons",
            "description": "Finding perfect Icons for project is a bit difficult task but now We are going to provide a list of Icons that you can use to build your projects faster and easier than ever before. You can also search for Icons according to Free, or Freemium/Paid.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "Dry Icons",
                    "description": "Dry Icons is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://dryicons.com/",
                    "type": "Freemium"
                },
                {
                    "id": 2,
                    "name" : "Flaticon",
                    "description": "Flaticon is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.flaticon.com/",
                    "type": "Freemium"

                },
                {
                    "id": 3,
                    "name" : "Icons8",
                    "description": "Icons8 is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://icons8.com/",
                    "type": "Freemium"
                },
                {
                    "id": 4,
                    "name" : "FontAwesome",
                    "description": "FontAwesome is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://fontawesome.com/",
                    "type": "Freemium"
                },
                {
                    "id": 5,
                    "name" : "The Noun Project",
                    "description": "The Noun Project is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://thenounproject.com/",
                    "type": "Free"
                },
                {
                    "id": 6,
                    "name" : "FreePik",
                    "description": "FreePik is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.freepik.com/",
                    "type": "Freemium"
                },
                {
                    "id": 7,
                    "name" : "IconScout",
                    "description": "IconScout is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://iconscout.com/",
                    "type": "Freemium"
                },
                {
                    "id": 8,
                    "name" : "Google Icons",
                    "description": "Google Icons is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://fonts.google.com/icons",
                    "type": "Free"
                },
                {
                    "id": 9,
                    "name" : "UX wing",
                    "description": "UX wing is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://uxwing.com/",
                    "type": "Free"
                },
                {
                    "id": 10,
                    "name" : "LordIcon",
                    "description": "LordIcon is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://lordicon.com/",
                    "type": "Freemium"
                },
                {
                    "id": 11,
                    "name" : "IconMonstr",
                    "description": "IconMonstr is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://iconmonstr.com/",
                    "type": "Free"
                },
                {
                    "id": 12,
                    "name" : "Hand Drawn Icons",
                    "description": "Hand Drawn Icons is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://goodstuffnononsense.com/hand-drawn-icons/",
                    "type": "Free"
                },
                {
                    "id": 13,
                    "name" : "Pixeden",
                    "description": "Pixeden is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.pixeden.com/icons-set",
                    "type": "Free"
                },
                {
                    "id":14,
                    "name" : "Icon Finder",
                    "description": "Icon Finder is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.iconfinder.com/",
                    "type": "Freemium"
                },
                {
                    "id":15,
                    "name" : "FreeIcons",
                    "description": "FreeIcons is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://freeicons.io/",
                    "type": "Free"
                },
                {
                    "id":16,
                    "name" : "1001 Free Download",
                    "description": "1001 Free Download is a website which provides a list of Icons that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.1001freedownloads.com/free-icons/",
                    "type": "Free"
                }
            ]
        },
        {
            "id": "images-link",
            "name" : "Images",
            "description": "Images are a great way to make your website look more attractive. Here are some websites that you can use to find images for your website. You can also search for images according Free or Freemium.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "Stock Snap",
                    "description": "Dry Icons is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://stocksnap.io/",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "PixaBay",
                    "description": "PixaBay is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://pixabay.com/",
                    "type": "Freemium"
                },
                {
                    "id": 3,
                    "name" : "Pexels",
                    "description": "Pexels is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.pexels.com/",
                    "type": "Freemium"
                },
                {
                    "id": 4,
                    "name" : "UnSplash",
                    "description": "UnSplash is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://unsplash.com/",
                    "type": "Freemium"
                },
                {
                    "id": 5,
                    "name" : "Free Images",
                    "description": "Free Images is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.freeimages.com/",
                    "type": "Freemium"
                },
                {
                    "id": 6,
                    "name" : "Kaboom Pics",
                    "description": "Kaboom Pics is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://kaboompics.com/",
                    "type": "Freemium"
                },
                {
                    "id": 7,
                    "name" : "Travel Coffee Book",
                    "description": "Travel Coffee Book is a website which provides a list of nature Images that you can use to build your projects faster and easier than ever before.",
                    "url": "http://travelcoffeebook.com/",
                    "type": "Free"
                },
                {
                    "id": 8,
                    "name" : "Burst Shopify",
                    "description": "Burst Shopify is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://burst.shopify.com/",
                    "type": "Free"
                },
                {
                    "id": 9,
                    "name" : "Free Range Stock",
                    "description": "Free Range Stock is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://freerangestock.com/",
                    "type": "Free"
                },
                {
                    "id": 10,
                    "name" : "Negative Space",
                    "description": "Negative Space is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://negativespace.co/",
                    "type": "Free"
                },
                {
                    "id": 11,
                    "name" : "MorgueFile",
                    "description": "MorgueFile is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://morguefile.com/",
                    "type": "Free"
                },
                {
                    "id": 12,
                    "name" : "Pic Jumbo",
                    "description": "Pic Jumbo is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://picjumbo.com/",
                    "type": "Free"
                },
                {
                    "id": 13,
                    "name" : "JayaMantri",
                    "description": "JayaMantri is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "http://jaymantri.com/",
                    "type": "Free"
                },
                {
                    "id":14,
                    "name" : "Get Refe",
                    "description": "Get Refe is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://getrefe.com/",
                    "type": "Freemium"
                },
                {
                    "id":15,
                    "name" : "New Old Stock",
                    "description": "New Old Stock is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://nos.twnsnd.co/",
                    "type": "Freemium"
                },
                {
                    "id":16,
                    "name" : "Flickr",
                    "description": "Flickr is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.flickr.com/",
                    "type": "Freemium"
                },
                {
                    "id":17,
                    "name" : "ReShot",
                    "description": "ReShot is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.reshot.com/",
                    "type": "Freemium"
                },
                {
                    "id":18,
                    "name" : "Gratisography",
                    "description": "Gratisography is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://gratisography.com/",
                    "type": "Free"
                },
                {
                    "id":19,
                    "name" : "Life Of Pix",
                    "description": "Life Of Pix is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.lifeofpix.com/",
                    "type": "Free"
                },
                {
                    "id":20,
                    "name" : "SplitShire",
                    "description": "SplitShire is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.splitshire.com/",
                    "type": "Free"
                },
                {
                    "id":21,
                    "name" : "SplitShire",
                    "description": "SplitShire is a website which provides a list of Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.splitshire.com/",
                    "type": "Free"
                },
                {
                    "id":22,
                    "name" : "Stick PNG",
                    "description": "Stick PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.stickpng.com/",
                    "type": "Free"
                },
                {
                    "id":23,
                    "name" : "png all",
                    "description": "png all is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.pngall.com/",
                    "type": "Free"
                },
                {
                    "id":24,
                    "name" : "Png Find",
                    "description": "Png Find is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.pngfind.com/",
                    "type": "Free"
                },
                {
                    "id":25,
                    "name" : "HipPop PNG",
                    "description": "HipPop PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.hippopng.com/",
                    "type": "Free"
                },
                {
                    "id":26,
                    "name" : "Free PNG",
                    "description": "Free PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://freepngimg.com/",
                    "type": "Free"
                },
                {
                    "id":27,
                    "name" : "Pure PNG",
                    "description": "Pure PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://purepng.com/",
                    "type": "Free"
                },
                {
                    "id":28,
                    "name" : "PNG mart",
                    "description": "PNG mart is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.pngmart.com/",
                    "type": "Free"
                },
                {
                    "id":29,
                    "name" : "Free PNG",
                    "description": "Free PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.freepngs.com/",
                    "type": "Free"
                },
                {
                    "id":30,
                    "name" : "Clean PNG",
                    "description": "Clean PNG is a website which provides a list of PNG Images that you can use to build your projects faster and easier than ever before.",
                    "url": "https://www.cleanpng.com/",
                    "type": "Free"
                }
            ]
        },
        {
            "id": "youtube-channels",
            "name" : "Youtube",
            "description": "Finding perfect videos or channels for learning or creating project is a bit difficult task but now We are going to provide a list of channles that you can use to build your projects faster and easier than ever before.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "The New Boston",
                    "description": "Founded by Bucky Roberts and With more than two million subscribers, TheNewBoston teaches web development and many more languages on his YouTube channel for beginners.",
                    "url": "https://www.youtube.com/user/thenewboston/videos",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "Edureka",
                    "description": "Founded by Lovleen Bhatia, Kapil Tyagi, and Pankaj Kumar, Edureka teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/user/edurekaIN",
                    "type": "Free"

                },
                {
                    "id": 3,
                    "name" : "Programming With Mosh",
                    "description": "Founded by Mosh Hamedani, Programming With Mosh teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/user/programmingwithmosh",
                    "type": "Free"

                },
                {
                    "id": 4,
                    "name" : "Traversy Media",
                    "description": "Founded by Brad Traversy, Traversy Media teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/user/TechGuyWeb",
                    "type": "Free"

                },
                {
                    "id": 5,
                    "name" : "ProgrammingKnowledge",
                    "description": "Founded by Yogesh Patel, ProgrammingKnowledge teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/channel/UCs6nmQViDpUw0nuIx9c_WvA",
                    "type": "Free"

                },
                {
                    "id": 6,
                    "name" : "Derek Banas",
                    "description": "Founded by Derek Banas, Derek Banas teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/user/derekbanas",
                    "type": "Free"

                },
                {
                    "id": 7,
                    "name" : "Eli the computer guy",
                    "description": "Founded by Eli the computer guy, Eli the computer guy teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/channel/UCD4EOyXKjfDUhCI6jlOZZYQ",
                    "type": "Free"

                },
                {
                    "id": 8,
                    "name" : "Design Course",
                    "description": "Founded by Gary Simon, Design Course teaches web design and development on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/channel/UCVyRiMvfUNMA1UPlDPzG5Ow",
                    "type": "Free"

                },
                {
                    "id": 9,
                    "name" : "The Net Ninja",
                    "description": "Founded by Shaun Pelling, This channel offers over 1000 free programming tutorials about Modern JavaScript (beginner to advanced), Node.js, React, Vue.js, Firebase, MongoDB, and many more. ",
                    "url": "https://www.youtube.com/c/TheNetNinja/featured",
                    "type": "Free"

                },
                {
                    "id": 10,
                    "name" : "Academind",
                    "description": "Founded by Maximilian Schwarzmller, Academind teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/channel/UCSJbGtTlrDami-tDGPUV9-w",
                    "type": "Free"

                },
                {
                    "id": 11,
                    "name" : "Web Dev Simplified",
                    "description": "Founded by Kyle Cook, Web Dev Simplified teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/c/WebDevSimplified",
                    "type": "Free"

                },
                {
                    "id": 12,
                    "name" : "Kevin Powell",
                    "description": "Founded by Kevin Powell, Kevin Powell teaches web development and many more languages on his YouTube channel for beginners. ",
                    "url": "https://www.youtube.com/kepowob/videos",
                    "type": "Free"

                }
            ]
        },
        {
            "id": "udemy-courses",
            "name" : "Udemy Courses",
            "description": "Udemy is a great platform to learn new things, from this list you can find the best udemy courses that you can buy to learn new things and improve your skills. This list includes both free and paid courses.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "HTML / CSS",
                    "description": "This course has been created by Jonas Schmedtmann, learn to build responsive websites using HTML5 and CSS3. Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/design-and-develop-a-killer-website-with-html5-and-css3/",
                    "type": "Paid"
                },
                {
                    "id": 2,
                    "name" : "HTML / CSS",
                    "description": "This course has been created by Brad Traversy, learn to build responsive websites using HTML5 and CSS3. Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/modern-html-css-from-the-beginning/",
                    "type": "Paid"

                },
                {
                    "id": 3,
                    "name" : "HTML / CSS",
                    "description": "This course has been created by Stone river learning, learn to build resonsive websites using HTML5 and CSS3 for free from this course.",
                    "url": "https://www.udemy.com/course/html5-fundamentals-for-beginners/",
                    "type": "Free"

                },
                {
                    "id": 4,
                    "name" : "JavaScript",
                    "description": "This course has been created by Jonas Schmedtmann, learn about JavaScript. Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/the-complete-javascript-course/",
                    "type": "Paid"

                },
                {
                    "id": 5,
                    "name" : "JavaScript",
                    "description": "This course has been created by Maximilian Schwarzmller, learn about JavaScript. Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/javascript-the-complete-guide-2020-beginner-advanced/",
                    "type": "Paid"

                },
                {
                    "id": 6,
                    "name" : "JavaScript",
                    "description": "This course has been created by Lawrence Turton, learn about JavaScript for free from this course.",
                    "url": "https://www.udemy.com/course/javascript-essentials/",
                    "type": "Free"

                },
                {
                    "id": 7,
                    "name" : "JavaScript",
                    "description": "This course has been created by Bharath Thippireddy, learn about JavaScript for free from this course",
                    "url": "https://www.udemy.com/course/javascriptfundamentals/",
                    "type": "Free"

                },
                {
                    "id": 8,
                    "name" : "Web Dev BootCamp",
                    "description": "This course has been created by Angela Yu, learn to build responsive websites using HTML5, CSS3, JavaScript, Bootstrap 4, DOM Manipulation, jQuery, Node, NPM, Express.js, and MongoDB. Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/the-complete-web-development-bootcamp/",
                    "type": "Paid"

                },
                {
                    "id": 9,
                    "name" : "Node Js",
                    "description": "This course has been created by Maximilian Schwarzmller, learn about Node JS, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/nodejs-the-complete-guide/",
                    "type": "Paid"

                },
                {
                    "id": 10,
                    "name" : "Node Js",
                    "description": "This course has been created by Jonas Schmedtmann, learn about Node JS, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/nodejs-express-mongodb-bootcamp/",
                    "type": "Paid"

                },
                {
                    "id": 11,
                    "name" : "Mongo DB",
                    "description": "This course has been created by Academind, learn about Mongo DB, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/mongodb-the-complete-developers-guide/",
                    "type": "Paid"

                },
                {
                    "id": 12,
                    "name" : "MySQL",
                    "description": "This course has been created by Colt Steele, learn about MySQL, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/the-ultimate-mysql-bootcamp-go-from-sql-beginner-to-expert/",
                    "type": "Paid"

                },
                {
                    "id": 13,
                    "name" : "React JS",
                    "description": "This course has been created by Academind, learn about React JS, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/react-the-complete-guide-incl-redux/ ",
                    "type": "Paid"

                },
                {
                    "id": 14,
                    "name" : "React JS",
                    "description": "This course has been created by John Smilga, learn about React JS, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/react-tutorial-and-projects-course/",
                    "type": "Paid"

                },
                {
                    "id": 15,
                    "name" : "React JS",
                    "description": "This course has been created by Ryan Dhungel, learn about React JS for free from this course.",
                    "url": "https://www.udemy.com/course/react-tutorial/",
                    "type": "Free"

                },
                {
                    "id": 16,
                    "name" : "React JS",
                    "description": "This course has been created by Sangam Mukherjee, learn about React JS for free from this course.",
                    "url": "https://www.udemy.com/course/react-js-crash-course-2023-build-a-food-managing-app/",
                    "type": "Free"

                },
                {
                    "id": 17,
                    "name" : "MERN Stack",
                    "description": "This course has been created by Maximilian Schwarzmller, learn about MERN Stack, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/react-nodejs-express-mongodb-the-mern-fullstack-guide/",
                    "type": "Paid"

                },
                {
                    "id": 18,
                    "name" : "MEAN Stack",
                    "description": "This course has been created by Maximilian Schwarzmller, learn about MEAN Stack, Even if you know nothing about coding, this course will take you from beginner to mastery.",
                    "url": "https://www.udemy.com/course/angular-2-and-nodejs-the-practical-guide/",
                    "type": "Paid"

                },
                {
                    "id": 19,
                    "name" : "Node Js API" ,
                    "description": "This course has been created by Ryan Dhungel, learn about Node Js API for free from this course.",
                    "url": "https://www.udemy.com/course/node-js-api-tutorial/",
                    "type": "Free"

                }
            ]
        },
        {
            "id": "chrome-extensions",
            "name" : "Chrome Extension",
            "description": "Chrome extensions are something that can make your life easier. We are going to provide a list of chrome extensions that you can use to build your projects faster and easier than ever before. You can also search extensions according to free or paid.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "JavaScript and CSS Beautifier",
                    "description": "It is really difficult to read Javascript and CSS minfied codes. Fortunately, we can now add intending, necessary space and line breaks in such JavaScript and CSS documents, including minified, with a click of a button thanks to the JavaScript and CSS Code Beautifier.",
                    "url": "https://chrome.google.com/webstore/detail/javascript-and-css-code-b/iiglodndmmefofehaibmaignglbpdald?hl=en",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "Web Developer",
                    "description": "Web Developer is a Chrome extension that adds a toolbar button to the browser with various web developer tools. It allows you to view the source code of a page, validate a page's HTML, CSS, and RSS feeds, view the page's info, and more.",
                    "url": "https://chrome.google.com/webstore/detail/web-developer/bfbameneiokkgbdmiekhjnmfkcnldhhm?hl=en-US",
                    "type": "Free"

                },
                {
                    "id": 3,
                    "name" : "Web Maker",
                    "description": "Web Maker is a Chrome extension that allows you to create and edit HTML, CSS, and JavaScript code. It also allows you to preview your code in real-time. This tool offers much more functionality than inbuilt Chrome Developer Tools.",
                    "url": "https://chrome.google.com/webstore/detail/web-maker/lkfkkhfhhdkiemehlpkgjeojomhpccnh?hl=en",
                    "type": "Free"

                },
                {
                    "id": 4,
                    "name" : "WhatFont",
                    "description": "I know you know how to find out the fonts used on a web page using Chrome Developer Tools easily. But WhatFont is a Chrome extension that allows you to identify the font used on any website. It also allows you to download the font and use it in your own projects.",
                    "url": "https://chrome.google.com/webstore/detail/whatfont/jabopobgcpjmedljpbcaablpmlmfcogm?hl=en",
                    "type": "Free"

                },
                {
                    "id": 5,
                    "name" : "Checkbot: SEO",
                    "description": "Checkbot is a Chrome extension that allows you to check your website for SEO, speed, security, and more. It also allows you to fix issues and improve your website. It compares websites based on 50+ best practices recommended by W3Z, Google and Mozilla, etc.",
                    "url": "https://chrome.google.com/webstore/detail/seo-web-speed-security-te/dagohlmlhagincbfilmkadjgmdnkjinl?hl=en",
                    "type": "Freemium"

                },
                {
                    "id": 6,
                    "name" : "Web Developer Checklist",
                    "description": "This is one of the most useful Chrome addons for UX designers, developer, SEO analysts and all professionals dealing with a website. It helps us to figure out whether a website follows best practices of web design and development. Sometimes, we may overlook something and may not notice until we run into some issue later.",
                    "url": "https://chrome.google.com/webstore/detail/web-developer-checklist/iahamcpedabephpcgkeikbclmaljebjp?hl=en",
                    "type": "Free"

                },
                {
                    "id": 7,
                    "name" : "ColorZilla",
                    "description": "ColorZilla is a Chrome extension that allows you to pick colors from any web page or from advanced color picker. It also allows you to generate CSS gradients and more. It is one of the commonly used Chrome extensions for web designers.",
                    "url": "https://chrome.google.com/webstore/detail/colorzilla/bhlhnicpbhignbdhedgjhgdocnmhomnp?hl=en%20",
                    "type": "Free"

                },
                {
                    "id": 8,
                    "name" : "Lorem Ipsum Generator",
                    "description": "This extension makes generating dummy text a lot faster. Just click the extension icon on the browser toolbar and select how many paragraphs and how many sentences in a paragraph you need. The extension will immediately generate the dummy text, and you can copy that directly.",
                    "url": "https://chrome.google.com/webstore/detail/lorem-ipsum-generator-def/mcdcbjjoakogbcopinefncmkcamnfkdb?hl=en%20",
                    "type": "Free"

                },
                {
                    "id": 9,
                    "name" : "Wappalyzer",
                    "description": "Wappalyzer is a Chrome extension that allows you to identify the technologies used on a website. It also allows you to find out the server, CMS, frameworks, and more. It is one of the most popular Chrome extensions for web developers.",
                    "url": "https://chrome.google.com/webstore/detail/wappalyzer/gppongmhjkpfnbhagpmjfkannfbllamg/related?hl=en%20",
                    "type": "Free"

                },
                {
                    "id": 10,
                    "name" : "Clear Cache",
                    "description": "Clear Cache is a Chrome extension that allows you to clear your cache and browsing data with a single click of a button. It also allows you to clear your cookies, history, and more. It is one of the most popular Chrome extensions for web developers. ",
                    "url": "https://chrome.google.com/webstore/detail/clear-cache/cppjkneekbjaeellbfkmgnhonkkjfpdn?hl=en",
                    "type": "Free"

                },
                {
                    "id": 11,
                    "name" : "IE Tab",
                    "description": "This tool is a very useful tool for web designers to detect cross-browser issues. Internet Explorer (IE) in the Windows is a nightmare for the designers. What works well on other browsers may not work in IE. It might be difficult to open IE and check if the web page is rendered each time we modify the page.",
                    "url": "https://chrome.google.com/webstore/detail/ie-tab/hehijbfgiekmjfkfjpbkbammjbdenadd?hl=en",
                    "type": "Free"

                },
                {
                    "id": 12,
                    "name" : "Page Ruler",
                    "description": "Page Ruler is a Chrome extension that allows you to draw a ruler to get pixel dimensions and positioning, and measure elements on any web page. It is one of the most popular Chrome extensions for web designers. Apart from the dimensions, this tool also helps us to figure out the position of the rectangles we draw.",
                    "url": "https://chrome.google.com/webstore/detail/page-ruler/jlpkojjdgbllmedoapgfodplfhcbnbpn?hl=en",
                    "type": "Free"

                },
                {
                    "id": 13,
                    "name" : "CSS Viewer",
                    "description": "This is one of the best Chrome extensions for web designers to find out the style of any element in a web page easily. The interface of the tool which displays the CSS properties is straightforward and intuitive. All you need to view the CSS properties used to style an element is clicking the extension icon on the browser toolbar and bring the mouse over the element.",
                    "url": "https://chrome.google.com/webstore/detail/cssviewer/ggfgijbpiheegefliciemofobhmofgce?hl=en",
                    "type": "Free"

                },
                {
                    "id": 14,
                    "name" : "CSS Peeper",
                    "description": "CSS Peeper is a Chrome extension that allows you to inspect CSS of any element on a web page. It also allows you to create a style guide for any website automatically. It is one of the most popular Chrome extensions for web designers.",
                    "url": "https://chrome.google.com/webstore/detail/css-peeper/mbnbehikldjhnfehhnaidhjhoofhpehk?hl=en",
                    "type": "Free"

                }
            ]
        },
        {
            "id": "github-repos",
            "name" : "Github Repositrories",
            "description": "Github is a great platform to find many useful things as a developer ,from this list you can find the best github repositories that you can use to learn new things and improve your skills. ", 

            "ideas":[
                {
                    "id": 1,
                    "name" : "Awesome cheatsheets",
                    "description": "Awesome cheatsheets is a collection of the best cheatsheets that you can find on the internet. It contains cheatsheets for many programming languages and frameworks. Go ahead and find the cheatsheet that you need.",
                    "url": "https://github.com/LeCoupa/awesome-cheatsheets",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "web dev resources",
                    "description": "This is a collection of the best web development resources that you can find on the internet. Created by Marko Denic, this repository contains resources for HTML, CSS, JavaScript, React, Vue, Angular, Node, Express, and more.",
                    "url": "https://github.com/markodenic/web-development-resources",
                    "type": "Free"

                },
                {
                    "id": 3,
                    "name" : "Design Patterns",
                    "description": "Created by Dov Amir it is A general, reusable solution to a commonly occurring problem within a given context in software design. It is a description or template for how to solve a problem that can be used in many different situations.",
                    "url": "https://github.com/DovAmir/awesome-design-patterns",
                    "type": "Free"

                },
                {
                    "id": 4,
                    "name" : "CSS pro tips",
                    "description": "This is a collection of tips to help take your CSS skills pro. It contains tips for CSS selectors, layout, animations, and more. It is one of the most popular Github repositories for web developers. ",
                    "url": "https://github.com/AllThingsSmitty/css-protips",
                    "type": "Free"

                },
                {
                    "id": 5,
                    "name" : "free programming books",
                    "description": "This is a collection of free programming books that are available on the internet. It contains books for many programming languages and frameworks. It is one of the most popular Github repositories for developers.",
                    "url": "https://github.com/EbookFoundation/free-programming-books",
                    "type": "Free"

                },
                {
                    "id": 6,
                    "name" : "art of cmd",
                    "description": " This is a collection of the best resources for the command line. It contains resources for Bash, Zsh, Fish, and more. It is one of the most popular Github repositories for developers.",
                    "url": "https://github.com/jlevy/the-art-of-command-line",
                    "type": "Free"

                },
                {
                    "id": 7,
                    "name" : "free code camp",
                    "description": "This is repository of the freeCodeCamp.org open source codebase and curriculum. Learn to code for free together with millions of people. ",
                    "url": "https://github.com/freeCodeCamp/freeCodeCamp",
                    "type": "Free"

                },
                {
                    "id": 8,
                    "name" : "front-end dev",
                    "description": "This is a collection of resource for front end developers, a useful repository in many ways.",
                    "url": "https://github.com/dypsilon/frontend-dev-bookmarks",
                    "type": "Free"

                },
                {
                    "id": 9,
                    "name" : "hackathon projects",
                    "description": "Developers from different parts of the world have developed a lot of amazing projects during hackathon. This is a curated list of awesome hackathon project. ",
                    "url": "https://github.com/Olanetsoft/awesome-hackathon-projects",
                    "type": "Free"

                },
                {
                    "id": 10,
                    "name" : "jamstack resources",
                    "description": "This is Curated list of tools using the JAMStack: A modern web development architecture for creating fast, secure and dynamic websites.",
                    "url": "https://github.com/Olanetsoft/awesome-jamstack-resources",
                    "type": "Free"

                },
                {
                    "id": 11,
                    "name" : "public api",
                    "description": "This is a collective list of free APIs for use in software and web development. Use it to create cool applications.",
                    "url": "https://github.com/public-apis/public-apis",
                    "type": "Free"

                }
            ]
        },
        {
            "id": "design-templates",
            "name" : "Website Design Templates",
            "description": "Finding perfect designs or templates for projects can be very hard, from this list you can find the best designs or templates for your projects. Use them correctly and make your projects look awesome. Although they are paid so you should use them after giving credits or attributes to the original creator. ",

            "ideas":[
                {
                    "id": 1,
                    "name" : "Colorlib",
                    "description": "Colorlib is the largest provider of free Bootstrap templates with more than 700 availabe and many more relased every month. They also provide free and premium themes for WordPress.",
                    "url": "https://colorlib.com/wp/templates/",
                    "type": "Paid"
                },
                {
                    "id": 2,
                    "name" : "ThemeForest",
                    "description": "ThemeForest is the largest global community of creatives. Their authors are talented professionals, extremely passionate about their work. They provide many templates for different platforms like WordPress, HTML, etc.",
                    "url": "https://themeforest.net/search/web%20developer",
                    "type": "Paid"

                },
                {
                    "id": 3,
                    "name" : "Nice Page",
                    "description": "Nicepage is a free mobile-friendly website builder. Choose from 1000+ trendy web templates. Customize to get the exact web design you like with no coding. Nicepage supports Windows, Mac OS, Online, Joomla, WordPress and HTML.",
                    "url": "https://nicepage.com/website-templates",
                    "type": "Paid"

                },
                {
                    "id": 4,
                    "name" : "Wix",
                    "description": "Wix is a cloud-based web development platform that allows users to create HTML5 websites and mobile sites, through the use of their online drag and drop tools. Users may add functionalities such as social plug-ins, e-commerce, contact forms, e-mail marketing, and community forums to their websites using a variety of Wix-developed and third-party applications.",
                    "url": "https://www.wix.com/website/templates",
                    "type": "Paid"

                },
                {
                    "id": 5,
                    "name" : "Template Monster",
                    "description": "TemplateMonster is a large and growing marketplace where you can find high-quality digital products matching the latest web standards. The collection of items includes a wide choice of website templates suitable for all kinds of niche-specific projects, small or large companies, startups, and any other kind of business that you happen to run.",
                    "url": "https://www.templatemonster.com/category/web-development-website-templates/",
                    "type": "Paid"

                },
                {
                    "id": 6,
                    "name" : "Dribbble",
                    "description": "Dribbble is a self-promotion and social networking platform for digital designers and creatives. It serves as a design portfolio platform, jobs and recruiting site and is one of the largest platforms for designers to share their work online.",
                    "url": "https://dribbble.com/",
                    "type": "Paid"

                }
            ]
        },
        {
            "id": "websites",
            "name" : "Useful websites",
            "description": "This is a list of useful websites for developers. You can find many useful resources from these websites.",

            "ideas":[
                {
                    "id": 1,
                    "name" : "Small Dev Tools",
                    "description": "This Website provides FREE handy developer tools like encoder/decoder, HTML/CSS/Javascript formatters, minifies, fake or test data generators, and much more which help the developers in different tasks.",
                    "url": "https://smalldev.tools/",
                    "type": "Free"
                },
                {
                    "id": 2,
                    "name" : "Profile Picture Maker",
                    "description": "This Website provides FREE profile pictures for your social media accounts. You can choose from a variety of themes and download them for free.",
                    "url": "https://pfpmaker.com/",
                    "type": "Free"

                },
                {
                    "id": 3,
                    "name" : "Poet.so",
                    "description": "Poet.so is a free tool to create beautiful images of your twitter screenshots. It is a free and open-source tool. You can use it to create beautiful images of your tweets and share them with your friends, followers, and co-workers.",
                    "url": "https://poet.so/",
                    "type": "Free"

                },
                {
                    "id": 4,
                    "name" : "MetaTags",
                    "description": "Meta Tags is a tool to debug and generate meta tag code for any website. With Meta Tags you can edit and experiment with your content then preview how your webpage will look on Google, Facebook, Twitter and more!",
                    "url": "https://metatags.io/",
                    "type": "Free"

                },
                {
                    "id": 5,
                    "name" : "Carbon",
                    "description": "Carbon is the easiest way to create and share beautiful images of your source code. You can use it to create beautiful images of your source code and share them with your friends, followers, and co-workers.",
                    "url": "https://carbon.now.sh/",
                    "type": "Free"

                },
                {
                    "id": 6,
                    "name" : "Color Hunt",
                    "description": "Color Hunt is a free and open platform for color inspiration with thousands of trendy hand-picked color palettes. You can use it to find beautiful color palettes for your projects.",
                    "url": "https://colorhunt.co/",
                    "type": "Free"

                },
                {
                    "id": 7,
                    "name" : "Responsively",
                    "description": "Responsively helps you easily get started with development. It is a free and open-source tool. You can use it to test your website on different devices at the same time.",
                    "url": "https://responsively.app/",
                    "type": "Free"

                },
                {
                    "id": 8,
                    "name" : "OverAPI",
                    "description": "OverAPI.com is a site collecting all the cheatsheets,all! It's created to be an easy way to access the cheatsheets of the most used languages, frameworks, libraries and tools in one page.",
                    "url": "https://overapi.com/",
                    "type": "Free"

                },
                {
                    "id": 9,
                    "name" : "Code Beautify",
                    "description": "Code Beautify is a free and open-source tool. You can use it to beautify your code and make it more readable.",
                    "url": "https://codebeautify.org/",
                    "type": "Free"

                },
                {
                    "id": 10,
                    "name" : "Smart Mockup",
                    "description": "Smartmockups is an online tool that helps you create stunning marketing materials by turning your designs into beautiful photos. It is a free and open-source tool. You can use it to create beautiful images of your designs and share them with your friends, followers, and co-workers.",
                    "url": "https://smartmockups.com/",
                    "type": "Free"

                },
                {
                    "id": 11,
                    "name" : "CodePen.io",
                    "description": "CodePen is a social development environment for front-end designers and developers. Its the best place to build and deploy a website, show off your work, build test cases, and find inspiration.",
                    "url": "https://codepen.io/",
                    "type": "Free"

                }
            ]
        }

        
    ]
}